app/controllers/campaigns_controller.rb

SELECT * FROM `campaigns`
---
  def index
    @campaigns = Campaign.all

SELECT * FROM `campaigns` WHERE (`campaigns`.`id` = 2053932785)
---
  def show
    @campaign = Campaign.find(params[:id])

SELECT * FROM `campaigns` WHERE (`campaigns`.`id` = 2053932785)
---
  def edit
    @campaign = Campaign.find(params[:id])

SELECT * FROM `campaigns` WHERE (`campaigns`.`id` = 2053932785)
---
  def update
    @campaign = Campaign.find(params[:id])

SELECT * FROM `campaigns` WHERE (`campaigns`.`id` = 2053932785)
DELETE FROM `campaigns` WHERE `id` = 2053932785
---
  def destroy
    @campaign = Campaign.find(params[:id])
    @campaign.destroy