app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by_email(params[:email])
---
SELECT * FROM "users" WHERE ("users"."email" = 'sites@codyaray.com') LIMIT 1

  def update
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    if @user.save
---
UPDATE "users" SET "login_count" = 3, "persistence_token" = '8c8c9283ad27cd94301972abe07e2decc3a73e1635ff3cc7f893e3de2e71c8b7e9f968fda91a4aa0b5b50c3054b632abb6aa9e6492a399eac3cb5fd951215a5c', "perishable_token" = 'uUKW3IWokBphIKTkB97o', "last_request_at" = '2009-11-10 03:41:47', "last_login_at" = '2009-11-10 03:35:14', "crypted_password" = '9b6344f1064f8b071fe31c610428d0ececfa3097e9b59d29146c1f70eb797517d85980b8ebe74e474becbb329464677cbbc33e51252a422c0b21e970b229378b', "updated_at" = '2009-11-10 03:41:47', "current_login_at" = '2009-11-10 03:41:47', "password_salt" = '15ICJWPazKD-gu0WgCAt' WHERE "id" = 1

    def load_user_using_perishable_token
      @user = User.find_using_perishable_token(params[:id])
---
SELECT * FROM "users" WHERE (perishable_token = 'b7RDkBpn-LEDnfuokVH1' and updated_at > '2009-11-10 03:31:47') LIMIT 1