app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.save do |result|
---
INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "crypted_password", "single_access_token", "perishable_token", "current_login_ip", "password_salt", "current_login_at", "failed_login_count", "persistence_token", "login_count", "login", "email", "last_login_ip", "created_at") VALUES(NULL, '2009-11-10 02:15:14', '2009-11-10 02:15:14', 'f1f80d0f644ea1c1fb919a19b3eea7f3d58de66daa487db945d3a9778a581efa64123f3abb5e0ca71a6e26976d2e712a88b2bbd805f80396177a7ad8ca39bf33', 'Xhw_qTyVyi7h2l7dg4yc', '78yscVz5qVpWWxQmOyQE', '127.0.0.1', 'rhmSlQ0S7L25QEeqt41V', '2009-11-10 02:15:14', 0, '65dd15b9a3d9a6728fe1be63bd88483a707574276d6e46c5b7a74d5f2219a89f707f37e7ccda2b508853183264510b6d707c12d6edf45056a236b492fdb97e62', 1, 'codyaray', 'sites@codyaray.com', NULL, '2009-11-10 02:15:14')

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    @user.attributes = params[:user]
    @user.save do |result|
---
UPDATE "users" SET "perishable_token" = 'YDbCa8Qt91fJxxuuPDcj', "last_request_at" = '2009-11-10 02:15:39', "updated_at" = '2009-11-10 02:15:39' WHERE "id" = 1